{
  "metadata": {
    "total_size": 6731696584
  },
  "weight_map": {
    "atac_cell_projection.fc.bias": "pytorch_model-00002-of-00002.bin",
    "atac_cell_projection.fc.weight": "pytorch_model-00002-of-00002.bin",
    "atac_cell_projection.ln.bias": "pytorch_model-00002-of-00002.bin",
    "atac_cell_projection.ln.weight": "pytorch_model-00002-of-00002.bin",
    "atac_gene_projection.fc.bias": "pytorch_model-00002-of-00002.bin",
    "atac_gene_projection.fc.weight": "pytorch_model-00002-of-00002.bin",
    "atac_gene_projection.ln.bias": "pytorch_model-00002-of-00002.bin",
    "atac_gene_projection.ln.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.embeddings.LayerNorm.bias": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.embeddings.LayerNorm.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.embeddings.cls_token": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.embeddings.concat_embeddings.cat_fc.bias": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.embeddings.concat_embeddings.cat_fc.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.embeddings.concat_embeddings.cat_ln.bias": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.embeddings.concat_embeddings.cat_ln.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.embeddings.concat_embeddings.cat_proj.bias": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.embeddings.concat_embeddings.cat_proj.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.embeddings.modality_embeddings.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.embeddings.position_embeddings.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.embeddings.position_ids": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.embeddings.species_embeddings.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.embeddings.token_type_embeddings.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.embeddings.values_embeddings.linear1.bias": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.embeddings.values_embeddings.linear1.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.embeddings.values_embeddings.linear2.bias": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.embeddings.values_embeddings.linear2.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.embeddings.values_embeddings.norm.bias": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.embeddings.values_embeddings.norm.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.embeddings.word_embeddings.weight": "pytorch_model-00001-of-00002.bin",
    "encoder_atac.bert.encoder.backbone.layers.0.mixer.A_log": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.encoder.backbone.layers.0.mixer.D": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.encoder.backbone.layers.0.mixer.conv1d.bias": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.encoder.backbone.layers.0.mixer.conv1d.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.encoder.backbone.layers.0.mixer.dt_bias": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.encoder.backbone.layers.0.mixer.in_proj.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.encoder.backbone.layers.0.mixer.norm.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.encoder.backbone.layers.0.mixer.out_proj.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.encoder.backbone.layers.0.norm.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.encoder.backbone.layers.1.mixer.A_log": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.encoder.backbone.layers.1.mixer.D": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.encoder.backbone.layers.1.mixer.conv1d.bias": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.encoder.backbone.layers.1.mixer.conv1d.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.encoder.backbone.layers.1.mixer.dt_bias": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.encoder.backbone.layers.1.mixer.in_proj.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.encoder.backbone.layers.1.mixer.norm.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.encoder.backbone.layers.1.mixer.out_proj.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.encoder.backbone.layers.1.norm.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.encoder.backbone.layers.10.mixer.A_log": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.encoder.backbone.layers.10.mixer.D": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.encoder.backbone.layers.10.mixer.conv1d.bias": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.encoder.backbone.layers.10.mixer.conv1d.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.encoder.backbone.layers.10.mixer.dt_bias": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.encoder.backbone.layers.10.mixer.in_proj.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.encoder.backbone.layers.10.mixer.norm.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.encoder.backbone.layers.10.mixer.out_proj.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.encoder.backbone.layers.10.norm.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.encoder.backbone.layers.11.mixer.A_log": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.encoder.backbone.layers.11.mixer.D": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.encoder.backbone.layers.11.mixer.conv1d.bias": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.encoder.backbone.layers.11.mixer.conv1d.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.encoder.backbone.layers.11.mixer.dt_bias": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.encoder.backbone.layers.11.mixer.in_proj.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.encoder.backbone.layers.11.mixer.norm.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.encoder.backbone.layers.11.mixer.out_proj.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.encoder.backbone.layers.11.norm.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.encoder.backbone.layers.2.mixer.A_log": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.encoder.backbone.layers.2.mixer.D": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.encoder.backbone.layers.2.mixer.conv1d.bias": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.encoder.backbone.layers.2.mixer.conv1d.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.encoder.backbone.layers.2.mixer.dt_bias": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.encoder.backbone.layers.2.mixer.in_proj.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.encoder.backbone.layers.2.mixer.norm.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.encoder.backbone.layers.2.mixer.out_proj.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.encoder.backbone.layers.2.norm.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.encoder.backbone.layers.3.mixer.A_log": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.encoder.backbone.layers.3.mixer.D": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.encoder.backbone.layers.3.mixer.conv1d.bias": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.encoder.backbone.layers.3.mixer.conv1d.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.encoder.backbone.layers.3.mixer.dt_bias": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.encoder.backbone.layers.3.mixer.in_proj.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.encoder.backbone.layers.3.mixer.norm.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.encoder.backbone.layers.3.mixer.out_proj.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.encoder.backbone.layers.3.norm.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.encoder.backbone.layers.4.mixer.A_log": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.encoder.backbone.layers.4.mixer.D": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.encoder.backbone.layers.4.mixer.conv1d.bias": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.encoder.backbone.layers.4.mixer.conv1d.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.encoder.backbone.layers.4.mixer.dt_bias": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.encoder.backbone.layers.4.mixer.in_proj.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.encoder.backbone.layers.4.mixer.norm.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.encoder.backbone.layers.4.mixer.out_proj.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.encoder.backbone.layers.4.norm.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.encoder.backbone.layers.5.mixer.A_log": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.encoder.backbone.layers.5.mixer.D": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.encoder.backbone.layers.5.mixer.conv1d.bias": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.encoder.backbone.layers.5.mixer.conv1d.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.encoder.backbone.layers.5.mixer.dt_bias": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.encoder.backbone.layers.5.mixer.in_proj.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.encoder.backbone.layers.5.mixer.norm.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.encoder.backbone.layers.5.mixer.out_proj.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.encoder.backbone.layers.5.norm.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.encoder.backbone.layers.6.mixer.in_proj.bias": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.encoder.backbone.layers.6.mixer.in_proj.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.encoder.backbone.layers.6.mixer.out_proj.bias": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.encoder.backbone.layers.6.mixer.out_proj.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.encoder.backbone.layers.6.norm.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.encoder.backbone.layers.7.mixer.A_log": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.encoder.backbone.layers.7.mixer.D": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.encoder.backbone.layers.7.mixer.conv1d.bias": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.encoder.backbone.layers.7.mixer.conv1d.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.encoder.backbone.layers.7.mixer.dt_bias": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.encoder.backbone.layers.7.mixer.in_proj.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.encoder.backbone.layers.7.mixer.norm.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.encoder.backbone.layers.7.mixer.out_proj.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.encoder.backbone.layers.7.norm.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.encoder.backbone.layers.8.mixer.A_log": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.encoder.backbone.layers.8.mixer.D": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.encoder.backbone.layers.8.mixer.conv1d.bias": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.encoder.backbone.layers.8.mixer.conv1d.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.encoder.backbone.layers.8.mixer.dt_bias": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.encoder.backbone.layers.8.mixer.in_proj.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.encoder.backbone.layers.8.mixer.norm.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.encoder.backbone.layers.8.mixer.out_proj.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.encoder.backbone.layers.8.norm.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.encoder.backbone.layers.9.mixer.A_log": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.encoder.backbone.layers.9.mixer.D": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.encoder.backbone.layers.9.mixer.conv1d.bias": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.encoder.backbone.layers.9.mixer.conv1d.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.encoder.backbone.layers.9.mixer.dt_bias": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.encoder.backbone.layers.9.mixer.in_proj.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.encoder.backbone.layers.9.mixer.norm.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.encoder.backbone.layers.9.mixer.out_proj.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.encoder.backbone.layers.9.norm.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.bert.encoder.backbone.norm_f.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.cls.predictions.bias": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.cls.predictions.decoder.bias": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.cls.predictions.decoder.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.cls.predictions.transform.LayerNorm.bias": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.cls.predictions.transform.LayerNorm.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.cls.predictions.transform.dense.bias": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.cls.predictions.transform.dense.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.cls4clsPeakAlign.cat_fc.bias": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.cls4clsPeakAlign.cat_fc.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.cls4clsPeakAlign.cat_ln.bias": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.cls4clsPeakAlign.cat_ln.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.cls4clsPeakAlign.cat_proj.bias": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.cls4clsPeakAlign.cat_proj.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.cls4clsPeakIDFAlign.cat_fc.bias": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.cls4clsPeakIDFAlign.cat_fc.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.cls4clsPeakIDFAlign.cat_ln.bias": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.cls4clsPeakIDFAlign.cat_ln.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.cls4clsPeakIDFAlign.cat_proj.bias": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.cls4clsPeakIDFAlign.cat_proj.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.cls4peak_acc.predictions.bias": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.cls4peak_acc.predictions.decoder.bias": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.cls4peak_acc.predictions.decoder.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.cls4peak_acc.predictions.transform.LayerNorm.bias": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.cls4peak_acc.predictions.transform.LayerNorm.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.cls4peak_acc.predictions.transform.dense.bias": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.cls4peak_acc.predictions.transform.dense.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.kl_enc.mu_enc.bias": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.kl_enc.mu_enc.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.kl_enc.var_enc.bias": "pytorch_model-00002-of-00002.bin",
    "encoder_atac.kl_enc.var_enc.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.embeddings.LayerNorm.bias": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.embeddings.LayerNorm.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.embeddings.cls_token": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.embeddings.concat_embeddings.cat_fc.bias": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.embeddings.concat_embeddings.cat_fc.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.embeddings.concat_embeddings.cat_ln.bias": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.embeddings.concat_embeddings.cat_ln.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.embeddings.concat_embeddings.cat_proj.bias": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.embeddings.concat_embeddings.cat_proj.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.embeddings.modality_embeddings.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.embeddings.position_embeddings.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.embeddings.position_ids": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.embeddings.species_embeddings.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.embeddings.token_type_embeddings.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.embeddings.values_embeddings.linear1.bias": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.embeddings.values_embeddings.linear1.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.embeddings.values_embeddings.linear2.bias": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.embeddings.values_embeddings.linear2.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.embeddings.values_embeddings.norm.bias": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.embeddings.values_embeddings.norm.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.embeddings.word_embeddings.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.encoder.backbone.layers.0.mixer.A_log": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.encoder.backbone.layers.0.mixer.D": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.encoder.backbone.layers.0.mixer.conv1d.bias": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.encoder.backbone.layers.0.mixer.conv1d.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.encoder.backbone.layers.0.mixer.dt_bias": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.encoder.backbone.layers.0.mixer.in_proj.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.encoder.backbone.layers.0.mixer.norm.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.encoder.backbone.layers.0.mixer.out_proj.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.encoder.backbone.layers.0.norm.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.encoder.backbone.layers.1.mixer.A_log": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.encoder.backbone.layers.1.mixer.D": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.encoder.backbone.layers.1.mixer.conv1d.bias": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.encoder.backbone.layers.1.mixer.conv1d.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.encoder.backbone.layers.1.mixer.dt_bias": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.encoder.backbone.layers.1.mixer.in_proj.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.encoder.backbone.layers.1.mixer.norm.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.encoder.backbone.layers.1.mixer.out_proj.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.encoder.backbone.layers.1.norm.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.encoder.backbone.layers.10.mixer.A_log": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.encoder.backbone.layers.10.mixer.D": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.encoder.backbone.layers.10.mixer.conv1d.bias": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.encoder.backbone.layers.10.mixer.conv1d.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.encoder.backbone.layers.10.mixer.dt_bias": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.encoder.backbone.layers.10.mixer.in_proj.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.encoder.backbone.layers.10.mixer.norm.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.encoder.backbone.layers.10.mixer.out_proj.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.encoder.backbone.layers.10.norm.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.encoder.backbone.layers.11.mixer.A_log": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.encoder.backbone.layers.11.mixer.D": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.encoder.backbone.layers.11.mixer.conv1d.bias": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.encoder.backbone.layers.11.mixer.conv1d.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.encoder.backbone.layers.11.mixer.dt_bias": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.encoder.backbone.layers.11.mixer.in_proj.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.encoder.backbone.layers.11.mixer.norm.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.encoder.backbone.layers.11.mixer.out_proj.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.encoder.backbone.layers.11.norm.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.encoder.backbone.layers.2.mixer.A_log": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.encoder.backbone.layers.2.mixer.D": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.encoder.backbone.layers.2.mixer.conv1d.bias": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.encoder.backbone.layers.2.mixer.conv1d.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.encoder.backbone.layers.2.mixer.dt_bias": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.encoder.backbone.layers.2.mixer.in_proj.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.encoder.backbone.layers.2.mixer.norm.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.encoder.backbone.layers.2.mixer.out_proj.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.encoder.backbone.layers.2.norm.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.encoder.backbone.layers.3.mixer.A_log": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.encoder.backbone.layers.3.mixer.D": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.encoder.backbone.layers.3.mixer.conv1d.bias": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.encoder.backbone.layers.3.mixer.conv1d.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.encoder.backbone.layers.3.mixer.dt_bias": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.encoder.backbone.layers.3.mixer.in_proj.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.encoder.backbone.layers.3.mixer.norm.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.encoder.backbone.layers.3.mixer.out_proj.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.encoder.backbone.layers.3.norm.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.encoder.backbone.layers.4.mixer.A_log": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.encoder.backbone.layers.4.mixer.D": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.encoder.backbone.layers.4.mixer.conv1d.bias": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.encoder.backbone.layers.4.mixer.conv1d.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.encoder.backbone.layers.4.mixer.dt_bias": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.encoder.backbone.layers.4.mixer.in_proj.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.encoder.backbone.layers.4.mixer.norm.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.encoder.backbone.layers.4.mixer.out_proj.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.encoder.backbone.layers.4.norm.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.encoder.backbone.layers.5.mixer.A_log": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.encoder.backbone.layers.5.mixer.D": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.encoder.backbone.layers.5.mixer.conv1d.bias": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.encoder.backbone.layers.5.mixer.conv1d.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.encoder.backbone.layers.5.mixer.dt_bias": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.encoder.backbone.layers.5.mixer.in_proj.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.encoder.backbone.layers.5.mixer.norm.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.encoder.backbone.layers.5.mixer.out_proj.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.encoder.backbone.layers.5.norm.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.encoder.backbone.layers.6.mixer.in_proj.bias": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.encoder.backbone.layers.6.mixer.in_proj.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.encoder.backbone.layers.6.mixer.out_proj.bias": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.encoder.backbone.layers.6.mixer.out_proj.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.encoder.backbone.layers.6.norm.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.encoder.backbone.layers.7.mixer.A_log": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.encoder.backbone.layers.7.mixer.D": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.encoder.backbone.layers.7.mixer.conv1d.bias": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.encoder.backbone.layers.7.mixer.conv1d.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.encoder.backbone.layers.7.mixer.dt_bias": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.encoder.backbone.layers.7.mixer.in_proj.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.encoder.backbone.layers.7.mixer.norm.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.encoder.backbone.layers.7.mixer.out_proj.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.encoder.backbone.layers.7.norm.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.encoder.backbone.layers.8.mixer.A_log": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.encoder.backbone.layers.8.mixer.D": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.encoder.backbone.layers.8.mixer.conv1d.bias": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.encoder.backbone.layers.8.mixer.conv1d.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.encoder.backbone.layers.8.mixer.dt_bias": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.encoder.backbone.layers.8.mixer.in_proj.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.encoder.backbone.layers.8.mixer.norm.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.encoder.backbone.layers.8.mixer.out_proj.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.encoder.backbone.layers.8.norm.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.encoder.backbone.layers.9.mixer.A_log": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.encoder.backbone.layers.9.mixer.D": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.encoder.backbone.layers.9.mixer.conv1d.bias": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.encoder.backbone.layers.9.mixer.conv1d.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.encoder.backbone.layers.9.mixer.dt_bias": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.encoder.backbone.layers.9.mixer.in_proj.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.encoder.backbone.layers.9.mixer.norm.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.encoder.backbone.layers.9.mixer.out_proj.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.encoder.backbone.layers.9.norm.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.bert.encoder.backbone.norm_f.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.cls.predictions.bias": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.cls.predictions.decoder.bias": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.cls.predictions.decoder.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.cls.predictions.transform.LayerNorm.bias": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.cls.predictions.transform.LayerNorm.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.cls.predictions.transform.dense.bias": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.cls.predictions.transform.dense.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.cls4clsGeneAlign.param_proj.cat_fc.bias": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.cls4clsGeneAlign.param_proj.cat_fc.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.cls4clsGeneAlign.param_proj.cat_ln.bias": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.cls4clsGeneAlign.param_proj.cat_ln.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.cls4clsGeneAlign.param_proj.cat_proj.bias": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.cls4clsGeneAlign.param_proj.cat_proj.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.cls4value_rec.param_proj.cat_fc.bias": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.cls4value_rec.param_proj.cat_fc.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.cls4value_rec.param_proj.cat_ln.bias": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.cls4value_rec.param_proj.cat_ln.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.cls4value_rec.param_proj.cat_proj.bias": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.cls4value_rec.param_proj.cat_proj.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.kl_enc.mu_enc.bias": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.kl_enc.mu_enc.weight": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.kl_enc.var_enc.bias": "pytorch_model-00002-of-00002.bin",
    "encoder_rna.kl_enc.var_enc.weight": "pytorch_model-00002-of-00002.bin",
    "logit_scale": "pytorch_model-00002-of-00002.bin",
    "logit_scale_atac_A1A2": "pytorch_model-00002-of-00002.bin",
    "logit_scale_rna_R1R2": "pytorch_model-00002-of-00002.bin",
    "loss_R2R.param_proj.cat_fc.bias": "pytorch_model-00002-of-00002.bin",
    "loss_R2R.param_proj.cat_fc.weight": "pytorch_model-00002-of-00002.bin",
    "loss_R2R.param_proj.cat_ln.bias": "pytorch_model-00002-of-00002.bin",
    "loss_R2R.param_proj.cat_ln.weight": "pytorch_model-00002-of-00002.bin",
    "loss_R2R.param_proj.cat_proj.bias": "pytorch_model-00002-of-00002.bin",
    "loss_R2R.param_proj.cat_proj.weight": "pytorch_model-00002-of-00002.bin",
    "rna_cell_projection.fc.bias": "pytorch_model-00002-of-00002.bin",
    "rna_cell_projection.fc.weight": "pytorch_model-00002-of-00002.bin",
    "rna_cell_projection.ln.bias": "pytorch_model-00002-of-00002.bin",
    "rna_cell_projection.ln.weight": "pytorch_model-00002-of-00002.bin",
    "rna_gene_projection.fc.bias": "pytorch_model-00002-of-00002.bin",
    "rna_gene_projection.fc.weight": "pytorch_model-00002-of-00002.bin",
    "rna_gene_projection.ln.bias": "pytorch_model-00002-of-00002.bin",
    "rna_gene_projection.ln.weight": "pytorch_model-00002-of-00002.bin"
  }
}
